[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:8:20
 
 export default function AppNavbar({ currentUser, systemInfo, doLogout, currentUrl = window.location.href }) {
   
-  var oauthLogin = systemInfo?.oauthLogin || "/oauth2/authorization/google";
+  var oauthLogin = false;
   return (
     <>
killedBy: AppNavbar tests when oauthlogin undefined, default value is used
statusReason: Error: expect(element).toHaveAttribute("href", "/oauth2/authorization/google") // element.getAttribute("href") === "/oauth2/authorization/google"

Expected the element to have attribute:
  href="/oauth2/authorization/google"
Received:
  null

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:8:20
 
 export default function AppNavbar({ currentUser, systemInfo, doLogout, currentUrl = window.location.href }) {
   
-  var oauthLogin = systemInfo?.oauthLogin || "/oauth2/authorization/google";
+  var oauthLogin = true;
   return (
     <>
killedBy: AppNavbar tests when oauthlogin undefined, default value is used
statusReason: Error: expect(element).toHaveAttribute("href", "/oauth2/authorization/google") // element.getAttribute("href") === "/oauth2/authorization/google"

Expected the element to have attribute:
  href="/oauth2/authorization/google"
Received:
  null

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:12:9
   return (
     <>
       {
-        (currentUrl.startsWith("http://localhost:3000") ||
-          currentUrl.startsWith("http://127.0.0.1:3000")) && (
-          <AppNavbarLocalhost url={currentUrl} />
-        )
+        true
       }
       <Navbar expand="xl" variant="dark" bg="dark" sticky="top" data-testid="AppNavbar">
killedBy: AppNavbar tests renders the AppNavbarLocalhost when on http://localhost:3000
statusReason: Error: Unable to find an element by: [data-testid="AppNavbarLocalhost"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:12:9
   return (
     <>
       {
-        (currentUrl.startsWith("http://localhost:3000") ||
-          currentUrl.startsWith("http://127.0.0.1:3000")) && (
-          <AppNavbarLocalhost url={currentUrl} />
-        )
+        false
       }
       <Navbar expand="xl" variant="dark" bg="dark" sticky="top" data-testid="AppNavbar">
killedBy: AppNavbar tests renders the AppNavbarLocalhost when on http://localhost:3000
statusReason: Error: Unable to find an element by: [data-testid="AppNavbarLocalhost"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] MethodExpression
main/components/Nav/AppNavbar.js:13:11
     <>
       {
         (currentUrl.startsWith("http://localhost:3000") ||
-          currentUrl.startsWith("http://127.0.0.1:3000")) && (
+          currentUrl.endsWith("http://127.0.0.1:3000")) && (
           <AppNavbarLocalhost url={currentUrl} />
         )
killedBy: AppNavbar tests renders the AppNavbarLocalhost when on http://127.0.0.1:3000
statusReason: Error: Unable to find an element by: [data-testid="AppNavbarLocalhost"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:27:15
 
           <Nav className="me-auto">
             {
-              systemInfo?.springH2ConsoleEnabled && (
-                <>
-                  <Nav.Link href="/h2-console">H2Console</Nav.Link>
-                </>
-              )
+              true
             }
             {
killedBy: AppNavbar tests renders H2Console and Swagger links correctly
statusReason: Error: Unable to find an element with the text: H2Console. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:27:15
 
           <Nav className="me-auto">
             {
-              systemInfo?.springH2ConsoleEnabled && (
-                <>
-                  <Nav.Link href="/h2-console">H2Console</Nav.Link>
-                </>
-              )
+              false
             }
             {
killedBy: AppNavbar tests renders H2Console and Swagger links correctly
statusReason: Error: Unable to find an element with the text: H2Console. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:34:15
               )
             }
             {
-              systemInfo?.showSwaggerUILink && (
-                <>
-                  <Nav.Link href="/swagger-ui/index.html">Swagger</Nav.Link>
-                </>
-              )
+              systemInfo?.showSwaggerUILink || <>
+                  <Nav.Link href="/swagger-ui/index.html">Swagger</Nav.Link>
+                </>
             }
           </Nav>
killedBy: AppNavbar tests renders H2Console and Swagger links correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Swagger. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] OptionalChaining
main/components/Nav/AppNavbar.js:34:15
               )
             }
             {
-              systemInfo?.showSwaggerUILink && (
+              systemInfo.showSwaggerUILink && (
                 <>
                   <Nav.Link href="/swagger-ui/index.html">Swagger</Nav.Link>
killedBy: AppNavbar tests renders correctly for regular logged in user
statusReason: TypeError: Cannot read properties of undefined (reading 'showSwaggerUILink')

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:49:17
           <Navbar.Collapse className="justify-content-between">
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_ADMIN") && (
-                  <NavDropdown title="Admin" id="appnavbar-admin-dropdown" data-testid="appnavbar-admin-dropdown" >
-                    <NavDropdown.Item href="/admin/users">Users</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                true
               }
             </Nav>
killedBy: AppNavbar tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:49:17
           <Navbar.Collapse className="justify-content-between">
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_ADMIN") && (
-                  <NavDropdown title="Admin" id="appnavbar-admin-dropdown" data-testid="appnavbar-admin-dropdown" >
-                    <NavDropdown.Item href="/admin/users">Users</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                false
               }
             </Nav>
killedBy: AppNavbar tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:59:17
 
             <Nav className="ml-auto">
               {
-                currentUser && currentUser.loggedIn ? (
+                currentUser || currentUser.loggedIn ? (
                   <>
                     <Navbar.Text className="me-3" as={Link} to="/profile">Welcome, {currentUser.root.user.email}</Navbar.Text>
killedBy: AppNavbar tests when oauthlogin undefined, default value is used
statusReason: TypeError: Cannot read properties of undefined (reading 'email')

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:59:17
 
             <Nav className="ml-auto">
               {
-                currentUser && currentUser.loggedIn ? (
+                true ? (
                   <>
                     <Navbar.Text className="me-3" as={Link} to="/profile">Welcome, {currentUser.root.user.email}</Navbar.Text>
killedBy: AppNavbar tests when oauthlogin undefined, default value is used
statusReason: TypeError: Cannot read properties of undefined (reading 'email')
