[Killed] BlockStatement
main/components/Nav/Footer.js:3:34
 import { Container } from "react-bootstrap";
 
-export default function Footer() {
-  return (
-    <footer className="bg-light pt-3 pt-md-4 pb-4 pb-md-5">
-      <Container>
-        <p>
-          This is a sample webapp using React with a Spring Boot backend.
-        </p>
-      </Container>
-    </footer>
-  );
-}
+export default function Footer() {}
killedBy: AdminUsersPage tests renders without crashing on three users
statusReason: Error: Footer(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
