[Killed] BlockStatement
main/components/Profile/RoleBadge.js:4:56
 import React from 'react';
 import { Badge } from "react-bootstrap";
 
-export default function RoleBadge({role, currentUser}) {
-   
-  const roles = currentUser.root.roles.map( (o) => o.authority );
-
-  const lcrole = role.replace("ROLE_","").toLowerCase();
-  return (
-     roles.includes(role) ?
-        <Badge className="bg-primary" data-testid={`role-badge-${lcrole}`}>{lcrole}</Badge> 
-        :
-        <span data-testid={`role-missing-${lcrole}`}></span>
-  );
-}
+export default function RoleBadge({role, currentUser}) {}
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: Error: RoleBadge(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ArrowFunction
main/components/Profile/RoleBadge.js:6:45
 
 export default function RoleBadge({role, currentUser}) {
    
-  const roles = currentUser.root.roles.map( (o) => o.authority );
+  const roles = currentUser.root.roles.map( () => undefined );
 
   const lcrole = role.replace("ROLE_","").toLowerCase();
killedBy: ProfilePage tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="role-badge-user"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] MethodExpression
main/components/Profile/RoleBadge.js:8:18
    
   const roles = currentUser.root.roles.map( (o) => o.authority );
 
-  const lcrole = role.replace("ROLE_","").toLowerCase();
+  const lcrole = role.replace("ROLE_", "").toUpperCase();
   return (
      roles.includes(role) ?
killedBy: ProfilePage tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="role-badge-user"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/components/Profile/RoleBadge.js:8:39
    
   const roles = currentUser.root.roles.map( (o) => o.authority );
 
-  const lcrole = role.replace("ROLE_","").toLowerCase();
+  const lcrole = role.replace("ROLE_","Stryker was here!").toLowerCase();
   return (
      roles.includes(role) ?
killedBy: ProfilePage tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="role-badge-user"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/components/Profile/RoleBadge.js:13:28
      roles.includes(role) ?
         <Badge className="bg-primary" data-testid={`role-badge-${lcrole}`}>{lcrole}</Badge> 
         :
-        <span data-testid={`role-missing-${lcrole}`}></span>
+        <span data-testid={``}></span>
   );
 }
killedBy: RoleBadge tests renders without crashing for ROLE_ADMIN when user does NOT have ROLE_ADMIN
statusReason: Error: Unable to find an element by: [data-testid="role-missing-admin"]

<body>
  <div>
    <span
      data-testid=""
    />
  </div>
