[Killed] ArrayDeclaration
main/components/Users/UsersTable.js:4:17
 import React from "react";
 import OurTable from "main/components/OurTable"
 
-const columns = [
-    {
-        Header: 'id',
-        accessor: 'id', // accessor is the "key" in the data
-    },
-    {
-        Header: 'First Name',
-        accessor: 'givenName',
-    },
-    {
-        Header: 'Last Name',
-        accessor: 'familyName',
-    },
-    {
-        Header: 'Email',
-        accessor: 'email',
-    },
-    {
-        Header: 'Admin',
-        id: 'admin',
-        accessor: (row, _rowIndex) => String(row.admin) // hack needed for boolean values to show up
-    },
-];
+const columns = [];
 
 export default function UsersTable({ users }) {
killedBy: UserTable tests Has the expected colum headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Users/UsersTable.js:5:5
 import OurTable from "main/components/OurTable"
 
 const columns = [
-    {
-        Header: 'id',
-        accessor: 'id', // accessor is the "key" in the data
-    },
+    {},
     {
         Header: 'First Name',
killedBy: AdminUsersPage tests renders without crashing on three users
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Users/UsersTable.js:11:19
     },
     {
         Header: 'First Name',
-        accessor: 'givenName',
+        accessor: "",
     },
     {
killedBy: UserTable tests Has the expected colum headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-givenName"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Users/UsersTable.js:14:17
         accessor: 'givenName',
     },
     {
-        Header: 'Last Name',
+        Header: "",
         accessor: 'familyName',
     },
killedBy: UserTable tests Has the expected colum headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Last Name. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Users/UsersTable.js:18:17
         accessor: 'familyName',
     },
     {
-        Header: 'Email',
+        Header: "",
         accessor: 'email',
     },
killedBy: UserTable tests Has the expected colum headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Email. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Users/UsersTable.js:19:19
     },
     {
         Header: 'Email',
-        accessor: 'email',
+        accessor: "",
     },
     {
killedBy: UserTable tests Has the expected colum headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-email"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Users/UsersTable.js:22:17
         accessor: 'email',
     },
     {
-        Header: 'Admin',
+        Header: "",
         id: 'admin',
         accessor: (row, _rowIndex) => String(row.admin) // hack needed for boolean values to show up
killedBy: UserTable tests Has the expected colum headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Admin. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ArrowFunction
main/components/Users/UsersTable.js:24:19
     {
         Header: 'Admin',
         id: 'admin',
-        accessor: (row, _rowIndex) => String(row.admin) // hack needed for boolean values to show up
+        accessor: () => undefined // hack needed for boolean values to show up
     },
 ];
killedBy: UserTable tests Has the expected colum headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  true
Received:

[Killed] BlockStatement
main/components/Users/UsersTable.js:28:47
     },
 ];
 
-export default function UsersTable({ users }) {
-    return <OurTable
-        data={users}
-        columns={columns}
-        testid={"UsersTable"} />;
-};
+export default function UsersTable({ users }) {};
killedBy: UserTable tests renders without crashing for empty table
statusReason: Error: UsersTable(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
