[Killed] BlockStatement
src/main/pages/HomePage.js:3:36
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function HomePage() {
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>jpa03</h1>
-        <p>
-          This is a webapp containing a bunch of different Spring Boot/React examples.
-        </p>
-      </div>
-    </BasicLayout>
-  )
-}
+export default function HomePage() {}
killedBy: HomePage tests renders without crashing
statusReason: Error: HomePage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
