[Killed] BlockStatement
src/main/pages/ProfilePage.js:12:32
 
     const { data: currentUser } = useCurrentUser();
 
-    if (!currentUser.loggedIn) {
-        return (
-            <p>Not logged in.</p>
-        )
-    }
+    if (!currentUser.loggedIn) {}
 
     const { email, pictureUrl, fullName } = currentUser.root.user;
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: TypeError: Cannot read properties of null (reading 'user')

[Killed] BooleanLiteral
src/main/pages/ProfilePage.js:12:9
 
     const { data: currentUser } = useCurrentUser();
 
-    if (!currentUser.loggedIn) {
+    if (currentUser.loggedIn) {
         return (
             <p>Not logged in.</p>
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: TypeError: Cannot read properties of null (reading 'user')
