[Killed] BlockStatement
src/main/utils/arrayUtils.js:3:51
 import { arrayMin, arrayMax } from "main/utils/minMax_NoStryker";
 
-const getFirstSmallestLargest = (list, mapper) => {
-  const first = mapper(list[0]);
-  const smallest = arrayMin(list.map(mapper));
-  const largest = arrayMax(list.map(mapper));
-  return { first, smallest, largest };
-};
+const getFirstSmallestLargest = (list, mapper) => {};
 
 export { getFirstSmallestLargest };
killedBy: arrayUtils tests getFirstSmallestLargest abbr
statusReason: TypeError: Cannot destructure property 'first' of '(0 , _arrayUtils.getFirstSmallestLargest)(...)' as it is undefined.

[Killed] ObjectLiteral
src/main/utils/arrayUtils.js:7:10
   const first = mapper(list[0]);
   const smallest = arrayMin(list.map(mapper));
   const largest = arrayMax(list.map(mapper));
-  return { first, smallest, largest };
+  return {};
 };
 
killedBy: arrayUtils tests getFirstSmallestLargest abbr
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CA"
Received: undefined
