[Killed] BlockStatement
src/main/utils/currentUser.js:5:34
 import axios from "axios";
 import { useNavigate } from "react-router-dom"
 
-export function useCurrentUser() {
-  let rolesList = ["ERROR_GETTING_ROLES"];
-  return useQuery("current user", async () => {
-    try {
-      const response = await axios.get("/api/currentUser");
-      try {
-        rolesList = response.data.roles.map((r) => r.authority);
-      } catch (e) {
-        console.error("Error getting roles: ", e);
-      }
-      response.data = { ...response.data, rolesList: rolesList }
-      return { loggedIn: true, root: response.data };
-    } catch (e) {
-      console.error("Error invoking axios.get: ", e);
-      return { loggedIn: false, root: null };
-    }
-  }, {
-    initialData: { loggedIn: false, root: null, initialData: true }
-  });
-}
+export function useCurrentUser() {}
 
 export function useLogout() {
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: TypeError: Cannot destructure property 'data' of '(0 , _currentUser.useCurrentUser)(...)' as it is undefined.

[Killed] BlockStatement
src/main/utils/currentUser.js:7:47
 
 export function useCurrentUser() {
   let rolesList = ["ERROR_GETTING_ROLES"];
-  return useQuery("current user", async () => {
-    try {
-      const response = await axios.get("/api/currentUser");
-      try {
-        rolesList = response.data.roles.map((r) => r.authority);
-      } catch (e) {
-        console.error("Error getting roles: ", e);
-      }
-      response.data = { ...response.data, rolesList: rolesList }
-      return { loggedIn: true, root: response.data };
-    } catch (e) {
-      console.error("Error invoking axios.get: ", e);
-      return { loggedIn: false, root: null };
-    }
-  }, {
+  return useQuery("current user", async () => {}, {
     initialData: { loggedIn: false, root: null, initialData: true }
   });
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser retrieves initial data
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"initialData": true, "loggedIn": false, "root": null}
Received: undefined

[Killed] BlockStatement
src/main/utils/currentUser.js:8:9
 export function useCurrentUser() {
   let rolesList = ["ERROR_GETTING_ROLES"];
   return useQuery("current user", async () => {
-    try {
-      const response = await axios.get("/api/currentUser");
-      try {
-        rolesList = response.data.roles.map((r) => r.authority);
-      } catch (e) {
-        console.error("Error getting roles: ", e);
-      }
-      response.data = { ...response.data, rolesList: rolesList }
-      return { loggedIn: true, root: response.data };
-    } catch (e) {
+    try {} catch (e) {
       console.error("Error invoking axios.get: ", e);
       return { loggedIn: false, root: null };
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser retrieves initial data
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"initialData": true, "loggedIn": false, "root": null}
Received: undefined

[Killed] StringLiteral
src/main/utils/currentUser.js:9:40
   let rolesList = ["ERROR_GETTING_ROLES"];
   return useQuery("current user", async () => {
     try {
-      const response = await axios.get("/api/currentUser");
+      const response = await axios.get("");
       try {
         rolesList = response.data.roles.map((r) => r.authority);
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser retrieves data from API
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 46
+ Received  +  2

  Object {
-   "loggedIn": true,
-   "root": Object {

[Killed] BlockStatement
src/main/utils/currentUser.js:10:11
   return useQuery("current user", async () => {
     try {
       const response = await axios.get("/api/currentUser");
-      try {
-        rolesList = response.data.roles.map((r) => r.authority);
-      } catch (e) {
+      try {} catch (e) {
         console.error("Error getting roles: ", e);
       }
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser retrieves data from API
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

@@ -24,14 +24,11 @@
        Object {
          "authority": "SCOPE_https://www.googleapis.com/auth/userinfo.email",

[Killed] ArrowFunction
src/main/utils/currentUser.js:11:45
     try {
       const response = await axios.get("/api/currentUser");
       try {
-        rolesList = response.data.roles.map((r) => r.authority);
+        rolesList = response.data.roles.map(() => undefined);
       } catch (e) {
         console.error("Error getting roles: ", e);
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser retrieves data from API
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

@@ -24,14 +24,14 @@
        Object {
          "authority": "SCOPE_https://www.googleapis.com/auth/userinfo.email",

[Killed] BlockStatement
src/main/utils/currentUser.js:12:19
       const response = await axios.get("/api/currentUser");
       try {
         rolesList = response.data.roles.map((r) => r.authority);
-      } catch (e) {
-        console.error("Error getting roles: ", e);
-      }
+      } catch (e) {}
       response.data = { ...response.data, rolesList: rolesList }
       return { loggedIn: true, root: response.data };
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser handles missing roles correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BooleanLiteral
src/main/utils/currentUser.js:16:26
         console.error("Error getting roles: ", e);
       }
       response.data = { ...response.data, rolesList: rolesList }
-      return { loggedIn: true, root: response.data };
+      return { loggedIn: false, root: response.data };
     } catch (e) {
       console.error("Error invoking axios.get: ", e);
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser retrieves data from API
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,7 +1,7 @@
  Object {
-   "loggedIn": true,

[Killed] ObjectLiteral
src/main/utils/currentUser.js:16:14
         console.error("Error getting roles: ", e);
       }
       response.data = { ...response.data, rolesList: rolesList }
-      return { loggedIn: true, root: response.data };
+      return {};
     } catch (e) {
       console.error("Error invoking axios.get: ", e);
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser retrieves data from API
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 48
+ Received  +  1

- Object {
-   "loggedIn": true,
-   "root": Object {

[Killed] BlockStatement
src/main/utils/currentUser.js:17:17
       }
       response.data = { ...response.data, rolesList: rolesList }
       return { loggedIn: true, root: response.data };
-    } catch (e) {
-      console.error("Error invoking axios.get: ", e);
-      return { loggedIn: false, root: null };
-    }
+    } catch (e) {}
   }, {
     initialData: { loggedIn: false, root: null, initialData: true }
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser retrieves initial data
statusReason: Error: Timed out in waitFor after 1000ms.

[Killed] StringLiteral
src/main/utils/currentUser.js:18:21
       response.data = { ...response.data, rolesList: rolesList }
       return { loggedIn: true, root: response.data };
     } catch (e) {
-      console.error("Error invoking axios.get: ", e);
+      console.error("", e);
       return { loggedIn: false, root: null };
     }
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser retrieves initial data
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Error invoking axios.get:/
Received string:  ""

[Killed] BooleanLiteral
src/main/utils/currentUser.js:19:26
       return { loggedIn: true, root: response.data };
     } catch (e) {
       console.error("Error invoking axios.get: ", e);
-      return { loggedIn: false, root: null };
+      return { loggedIn: true, root: null };
     }
   }, {
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser when API unreachable
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "loggedIn": false,
+   "loggedIn": true,

[Killed] BooleanLiteral
src/main/utils/currentUser.js:22:62
       return { loggedIn: false, root: null };
     }
   }, {
-    initialData: { loggedIn: false, root: null, initialData: true }
+    initialData: { loggedIn: false, root: null, initialData: false }
   });
 }
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser retrieves initial data
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "initialData": true,
+   "initialData": false,

[Killed] BooleanLiteral
src/main/utils/currentUser.js:22:30
       return { loggedIn: false, root: null };
     }
   }, {
-    initialData: { loggedIn: false, root: null, initialData: true }
+    initialData: { loggedIn: true, root: null, initialData: true }
   });
 }
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser retrieves initial data
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "initialData": true,
-   "loggedIn": false,

[Killed] BlockStatement
src/main/utils/currentUser.js:26:29
   });
 }
 
-export function useLogout() {
-  const queryClient = useQueryClient();
-  const navigate = useNavigate();
-  const mutation = useMutation(async () => {
-    await axios.post("/logout");
-    await queryClient.resetQueries("current user", { exact: true });
-    navigate("/");
-  })
-  return mutation;
-}
+export function useLogout() {}
 
 export function hasRole(currentUser, role) {
killedBy: utils/currentUser tests useLogout tests useLogout
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/main/utils/currentUser.js:29:44
 export function useLogout() {
   const queryClient = useQueryClient();
   const navigate = useNavigate();
-  const mutation = useMutation(async () => {
-    await axios.post("/logout");
-    await queryClient.resetQueries("current user", { exact: true });
-    navigate("/");
-  })
+  const mutation = useMutation(async () => {})
   return mutation;
 }
killedBy: utils/currentUser tests useLogout tests useLogout
statusReason: Error: Timed out in waitFor after 1000ms.

[Killed] StringLiteral
src/main/utils/currentUser.js:30:22
   const queryClient = useQueryClient();
   const navigate = useNavigate();
   const mutation = useMutation(async () => {
-    await axios.post("/logout");
+    await axios.post("");
     await queryClient.resetQueries("current user", { exact: true });
     navigate("/");
killedBy: utils/currentUser tests useLogout tests useLogout
statusReason: Error: Timed out in waitFor after 1000ms.

[Killed] BooleanLiteral
src/main/utils/currentUser.js:31:61
   const navigate = useNavigate();
   const mutation = useMutation(async () => {
     await axios.post("/logout");
-    await queryClient.resetQueries("current user", { exact: true });
+    await queryClient.resetQueries("current user", { exact: false });
     navigate("/");
   })
killedBy: utils/currentUser tests useLogout tests useLogout
statusReason: Error: Timed out in waitFor after 1000ms.

[Killed] ObjectLiteral
src/main/utils/currentUser.js:31:52
   const navigate = useNavigate();
   const mutation = useMutation(async () => {
     await axios.post("/logout");
-    await queryClient.resetQueries("current user", { exact: true });
+    await queryClient.resetQueries("current user", {});
     navigate("/");
   })
killedBy: utils/currentUser tests useLogout tests useLogout
statusReason: Error: Timed out in waitFor after 1000ms.

[Killed] BlockStatement
src/main/utils/currentUser.js:37:44
   return mutation;
 }
 
-export function hasRole(currentUser, role) {
-
-  // The following hack is because there is some bug in terms of the
-  // shape of the data returned by useCurrentUser.  Is there a separate 
-  // data level, or not? 
-
-  // We will file an issue to track that down and then remove this hack
-
-  if (currentUser == null) return false;
-
-  if ("data" in currentUser &&
-    "root" in currentUser.data &&
-    currentUser.data.root != null &&
-    "rolesList" in currentUser.data.root) {
-    return currentUser.data.root.rolesList.includes(role);
-  }
-
-  return currentUser.root?.rolesList?.includes(role);
-}
+export function hasRole(currentUser, role) {}
killedBy: utils/currentUser tests hasRole tests hasRole(x,"ROLE_ADMIN") returns correct values when currentUser properly defined
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] BooleanLiteral
src/main/utils/currentUser.js:45:35
 
   // We will file an issue to track that down and then remove this hack
 
-  if (currentUser == null) return false;
+  if (currentUser == null) return true;
 
   if ("data" in currentUser &&
killedBy: utils/currentUser tests hasRole tests hasRole(x,"ROLE_ADMIN") return falsy when currentUser ill-defined
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] ConditionalExpression
src/main/utils/currentUser.js:45:7
 
   // We will file an issue to track that down and then remove this hack
 
-  if (currentUser == null) return false;
+  if (true) return false;
 
   if ("data" in currentUser &&
killedBy: utils/currentUser tests hasRole tests hasRole(x,"ROLE_ADMIN") returns correct values when currentUser properly defined
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] ConditionalExpression
src/main/utils/currentUser.js:47:7
 
   if (currentUser == null) return false;
 
-  if ("data" in currentUser &&
-    "root" in currentUser.data &&
-    currentUser.data.root != null &&
-    "rolesList" in currentUser.data.root) {
+  if (false) {
     return currentUser.data.root.rolesList.includes(role);
   }
killedBy: utils/currentUser tests hasRole tests hasRole(x,"ROLE_ADMIN") returns correct values when currentUser has data then root
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] LogicalOperator
src/main/utils/currentUser.js:47:7
 
   if (currentUser == null) return false;
 
-  if ("data" in currentUser &&
-    "root" in currentUser.data &&
+  if ("data" in currentUser || "root" in currentUser.data &&
     currentUser.data.root != null &&
     "rolesList" in currentUser.data.root) {
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: TypeError: Cannot use 'in' operator to search for 'root' in undefined

[Killed] StringLiteral
src/main/utils/currentUser.js:48:5
   if (currentUser == null) return false;
 
   if ("data" in currentUser &&
-    "root" in currentUser.data &&
+    "" in currentUser.data &&
     currentUser.data.root != null &&
     "rolesList" in currentUser.data.root) {
killedBy: utils/currentUser tests hasRole tests hasRole(x,"ROLE_ADMIN") returns correct values when currentUser has data then root
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] EqualityOperator
src/main/utils/currentUser.js:49:5
 
   if ("data" in currentUser &&
     "root" in currentUser.data &&
-    currentUser.data.root != null &&
+    currentUser.data.root == null &&
     "rolesList" in currentUser.data.root) {
     return currentUser.data.root.rolesList.includes(role);
killedBy: utils/currentUser tests hasRole tests hasRole(x,"ROLE_ADMIN") returns correct values when currentUser has data then root
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] ConditionalExpression
src/main/utils/currentUser.js:49:5
 
   if ("data" in currentUser &&
     "root" in currentUser.data &&
-    currentUser.data.root != null &&
+    true &&
     "rolesList" in currentUser.data.root) {
     return currentUser.data.root.rolesList.includes(role);
killedBy: utils/currentUser tests hasRole tests hasRole(x,"ROLE_ADMIN") returns correct values when currentUser has data then root
statusReason: TypeError: Cannot use 'in' operator to search for 'rolesList' in null

[Killed] BlockStatement
src/main/utils/currentUser.js:50:43
   if ("data" in currentUser &&
     "root" in currentUser.data &&
     currentUser.data.root != null &&
-    "rolesList" in currentUser.data.root) {
-    return currentUser.data.root.rolesList.includes(role);
-  }
+    "rolesList" in currentUser.data.root) {}
 
   return currentUser.root?.rolesList?.includes(role);
killedBy: utils/currentUser tests hasRole tests hasRole(x,"ROLE_ADMIN") returns correct values when currentUser has data then root
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] StringLiteral
src/main/utils/currentUser.js:50:5
   if ("data" in currentUser &&
     "root" in currentUser.data &&
     currentUser.data.root != null &&
-    "rolesList" in currentUser.data.root) {
+    "" in currentUser.data.root) {
     return currentUser.data.root.rolesList.includes(role);
   }
killedBy: utils/currentUser tests hasRole tests hasRole(x,"ROLE_ADMIN") returns correct values when currentUser has data then root
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] OptionalChaining
src/main/utils/currentUser.js:54:10
     return currentUser.data.root.rolesList.includes(role);
   }
 
-  return currentUser.root?.rolesList?.includes(role);
+  return currentUser.root?.rolesList.includes(role);
 }
killedBy: utils/currentUser tests hasRole tests hasRole(x,"ROLE_ADMIN") return falsy when currentUser ill-defined
statusReason: TypeError: Cannot read properties of undefined (reading 'includes')

[Killed] OptionalChaining
src/main/utils/currentUser.js:54:10
     return currentUser.data.root.rolesList.includes(role);
   }
 
-  return currentUser.root?.rolesList?.includes(role);
+  return currentUser.root.rolesList?.includes(role);
 }
killedBy: utils/currentUser tests hasRole tests hasRole(x,"ROLE_ADMIN") return falsy when currentUser ill-defined
statusReason: TypeError: Cannot read properties of undefined (reading 'rolesList')
