[Killed] BlockStatement
src/main/utils/systemInfo.js:4:33
 import { useQuery } from "react-query";
 import axios from "axios";
 
-export function useSystemInfo() {
-  
-  return useQuery("systemInfo", async () => {
-    try {
-      const response = await axios.get("/api/systemInfo");
-      return response.data;
-    } catch (e) {
-      console.error("Error invoking axios.get: ", e);
-      return {  
-        springH2ConsoleEnabled: false,
-        showSwaggerUILink: false  
-      };
-    }
-  }, {
-    initialData: { 
-      initialData:true, 
-      springH2ConsoleEnabled: false,
-      showSwaggerUILink: false 
-    }
-  });
-
-}
+export function useSystemInfo() {}
 
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: TypeError: Cannot destructure property 'data' of '(0 , _systemInfo.useSystemInfo)(...)' as it is undefined.

[Killed] BlockStatement
src/main/utils/systemInfo.js:6:45
 
 export function useSystemInfo() {
   
-  return useQuery("systemInfo", async () => {
-    try {
-      const response = await axios.get("/api/systemInfo");
-      return response.data;
-    } catch (e) {
-      console.error("Error invoking axios.get: ", e);
-      return {  
-        springH2ConsoleEnabled: false,
-        showSwaggerUILink: false  
-      };
-    }
-  }, {
+  return useQuery("systemInfo", async () => {}, {
     initialData: { 
       initialData:true, 
killedBy: utils/systemInfo tests useSystemInfo tests useSystemInfo retrieves initial data
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"initialData": true, "showSwaggerUILink": false, "springH2ConsoleEnabled": false}
Received: undefined

[Killed] BlockStatement
src/main/utils/systemInfo.js:7:9
 export function useSystemInfo() {
   
   return useQuery("systemInfo", async () => {
-    try {
-      const response = await axios.get("/api/systemInfo");
-      return response.data;
-    } catch (e) {
+    try {} catch (e) {
       console.error("Error invoking axios.get: ", e);
       return {  
killedBy: utils/systemInfo tests useSystemInfo tests useSystemInfo retrieves initial data
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"initialData": true, "showSwaggerUILink": false, "springH2ConsoleEnabled": false}
Received: undefined

[Killed] BlockStatement
src/main/utils/systemInfo.js:10:17
     try {
       const response = await axios.get("/api/systemInfo");
       return response.data;
-    } catch (e) {
-      console.error("Error invoking axios.get: ", e);
-      return {  
-        springH2ConsoleEnabled: false,
-        showSwaggerUILink: false  
-      };
-    }
+    } catch (e) {}
   }, {
     initialData: { 
killedBy: utils/systemInfo tests useSystemInfo tests useSystemInfo retrieves initial data
statusReason: Error: Timed out in waitFor after 1000ms.

[Killed] BooleanLiteral
src/main/utils/systemInfo.js:13:33
     } catch (e) {
       console.error("Error invoking axios.get: ", e);
       return {  
-        springH2ConsoleEnabled: false,
+        springH2ConsoleEnabled: true,
         showSwaggerUILink: false  
       };
killedBy: utils/systemInfo tests useSystemInfo tests systemInfo when API unreachable
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "showSwaggerUILink": false,
-   "springH2ConsoleEnabled": false,

[Killed] BooleanLiteral
src/main/utils/systemInfo.js:14:28
       console.error("Error invoking axios.get: ", e);
       return {  
         springH2ConsoleEnabled: false,
-        showSwaggerUILink: false  
+        showSwaggerUILink: true  
       };
     }
killedBy: utils/systemInfo tests useSystemInfo tests systemInfo when API unreachable
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "showSwaggerUILink": false,
+   "showSwaggerUILink": true,

[Killed] BooleanLiteral
src/main/utils/systemInfo.js:19:19
     }
   }, {
     initialData: { 
-      initialData:true, 
+      initialData:false, 
       springH2ConsoleEnabled: false,
       showSwaggerUILink: false 
killedBy: utils/systemInfo tests useSystemInfo tests useSystemInfo retrieves initial data
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "initialData": true,
+   "initialData": false,

[Killed] BooleanLiteral
src/main/utils/systemInfo.js:20:31
   }, {
     initialData: { 
       initialData:true, 
-      springH2ConsoleEnabled: false,
+      springH2ConsoleEnabled: true,
       showSwaggerUILink: false 
     }
killedBy: utils/systemInfo tests useSystemInfo tests useSystemInfo retrieves initial data
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "initialData": true,
    "showSwaggerUILink": false,
