[Killed] BlockStatement
src/main/utils/useBackend.js:28:68
 //     []
 // );
 
-export function useBackend(queryKey, axiosParameters, initialData) {
-
-    return useQuery(queryKey, async () => {
-        try {
-            const response = await axios(axiosParameters);
-            return response.data;
-        } catch (e) {
-            const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
-            toast(errorMessage);
-            console.error(errorMessage, e);
-            throw e;
-        }
-    }, {
-        initialData
-    });
-}
+export function useBackend(queryKey, axiosParameters, initialData) {}
 
 // const wrappedParams = async (params) =>
killedBy: AdminUsersPage tests renders without crashing on three users
statusReason: TypeError: Cannot destructure property 'data' of '(0 , _useBackend.useBackend)(...)' as it is undefined.

[Killed] BlockStatement
src/main/utils/useBackend.js:30:43
 
 export function useBackend(queryKey, axiosParameters, initialData) {
 
-    return useQuery(queryKey, async () => {
-        try {
-            const response = await axios(axiosParameters);
-            return response.data;
-        } catch (e) {
-            const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
-            toast(errorMessage);
-            console.error(errorMessage, e);
-            throw e;
-        }
-    }, {
+    return useQuery(queryKey, async () => {}, {
         initialData
     });
killedBy: AdminUsersPage tests renders without crashing on three users
statusReason: TypeError: Cannot read properties of undefined (reading 'forEach')

[Killed] BlockStatement
src/main/utils/useBackend.js:31:13
 export function useBackend(queryKey, axiosParameters, initialData) {
 
     return useQuery(queryKey, async () => {
-        try {
-            const response = await axios(axiosParameters);
-            return response.data;
-        } catch (e) {
+        try {} catch (e) {
             const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
             toast(errorMessage);
killedBy: utils/useBackend tests utils/useBackend useBackend tests useBackend handles 404 error correctly
statusReason: Error: Timed out in waitFor after 1000ms.

[Killed] BlockStatement
src/main/utils/useBackend.js:34:21
         try {
             const response = await axios(axiosParameters);
             return response.data;
-        } catch (e) {
-            const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
-            toast(errorMessage);
-            console.error(errorMessage, e);
-            throw e;
-        }
+        } catch (e) {}
     }, {
         initialData
killedBy: AdminUsersPage tests renders empty table when backend unavailable
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Error communicating with backend via GET on /api/admin/users"
Received string:    "Error: Uncaught [TypeError: Cannot read properties of undefined (reading 'forEach')]

[Killed] BlockStatement
src/main/utils/useBackend.js:49:37
 //   await ( await axios(params)).data;
 
 
-const reportAxiosError = (error) => {
-    console.error("Axios Error:", error);
-    toast(`Axios Error: ${error}`);
-    return null;
-};
+const reportAxiosError = (error) => {};
 
 const wrappedParams = async (params) => {
killedBy: utils/useBackend tests utils/useBackend useBackendMutation tests useBackendMutation handles error correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 1

[Killed] StringLiteral
src/main/utils/useBackend.js:50:19
 
 
 const reportAxiosError = (error) => {
-    console.error("Axios Error:", error);
+    console.error("", error);
     toast(`Axios Error: ${error}`);
     return null;
killedBy: utils/useBackend tests utils/useBackend useBackendMutation tests useBackendMutation handles error correctly
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Axios Error:/
Received string:  ""

[Killed] StringLiteral
src/main/utils/useBackend.js:51:11
 
 const reportAxiosError = (error) => {
     console.error("Axios Error:", error);
-    toast(`Axios Error: ${error}`);
+    toast(``);
     return null;
 };
killedBy: utils/useBackend tests utils/useBackend useBackendMutation tests useBackendMutation handles error correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Axios Error: Error: Request failed with status code 404"
Received
       1: ""
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] BlockStatement
src/main/utils/useBackend.js:55:41
     return null;
 };
 
-const wrappedParams = async (params) => {
-    try {
-        return await (await axios(params)).data;
-    } catch (rejectedValue) {
-        reportAxiosError(rejectedValue);
-        throw rejectedValue;
-    }
-};
+const wrappedParams = async (params) => {};
 
 export function useBackendMutation(objectToAxiosParams, useMutationParams, queryKey=null) {
killedBy: utils/useBackend tests utils/useBackend useBackendMutation tests useBackendMutation handles success correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "New ucsbDate Created - id: 17 name: Groundhog Day"
Received: "TypeError: Cannot read properties of undefined (reading 'id')"

Number of calls: 1

[Killed] BlockStatement
src/main/utils/useBackend.js:56:9
 };
 
 const wrappedParams = async (params) => {
-    try {
-        return await (await axios(params)).data;
-    } catch (rejectedValue) {
+    try {} catch (rejectedValue) {
         reportAxiosError(rejectedValue);
         throw rejectedValue;
killedBy: utils/useBackend tests utils/useBackend useBackendMutation tests useBackendMutation handles success correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "New ucsbDate Created - id: 17 name: Groundhog Day"
Received: "TypeError: Cannot read properties of undefined (reading 'id')"

Number of calls: 1

[Killed] BlockStatement
src/main/utils/useBackend.js:58:29
 const wrappedParams = async (params) => {
     try {
         return await (await axios(params)).data;
-    } catch (rejectedValue) {
-        reportAxiosError(rejectedValue);
-        throw rejectedValue;
-    }
+    } catch (rejectedValue) {}
 };
 
killedBy: utils/useBackend tests utils/useBackend useBackendMutation tests useBackendMutation handles error correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 1

[Killed] BlockStatement
src/main/utils/useBackend.js:64:91
     }
 };
 
-export function useBackendMutation(objectToAxiosParams, useMutationParams, queryKey=null) {
-    const queryClient = useQueryClient();
-
-    return useMutation((object) => wrappedParams(objectToAxiosParams(object)), {
-        onError: (data) => {
-            toast(`${data}`)
-        },
-        // Stryker disable all: Not sure how to set up the complex behavior needed to test this
-        onSettled: () => {
-            if (queryKey!==null)
-             queryClient.invalidateQueries(queryKey);
-        },
-        // Stryker enable all
-        retry: false,
-        ...useMutationParams
-    })
-}
+export function useBackendMutation(objectToAxiosParams, useMutationParams, queryKey=null) {}
 
 
killedBy: utils/useBackend tests utils/useBackend useBackendMutation tests useBackendMutation handles success correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'mutate')

[Killed] ArrowFunction
src/main/utils/useBackend.js:67:24
 export function useBackendMutation(objectToAxiosParams, useMutationParams, queryKey=null) {
     const queryClient = useQueryClient();
 
-    return useMutation((object) => wrappedParams(objectToAxiosParams(object)), {
+    return useMutation(() => undefined, {
         onError: (data) => {
             toast(`${data}`)
killedBy: utils/useBackend tests utils/useBackend useBackendMutation tests useBackendMutation handles success correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "New ucsbDate Created - id: 17 name: Groundhog Day"
Received: "TypeError: Cannot read properties of undefined (reading 'id')"

Number of calls: 1

[Killed] BlockStatement
src/main/utils/useBackend.js:68:28
     const queryClient = useQueryClient();
 
     return useMutation((object) => wrappedParams(objectToAxiosParams(object)), {
-        onError: (data) => {
-            toast(`${data}`)
-        },
+        onError: (data) => {},
         // Stryker disable all: Not sure how to set up the complex behavior needed to test this
         onSettled: () => {
killedBy: utils/useBackend tests utils/useBackend useBackendMutation tests useBackendMutation handles error correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 1
